{
  "body": "**Is your income important to you? It's typically your biggest asset.** \n\nTraditionally, protection has been around death benefits, protecting the family if a breadwinner dies. However, what happens if the income earner becomes sick and is unable to their normal occupation or any other occupation for which they are trained in?\n\nAn Irish couple in their 30s have an 85% chance of losing an income for a month or longer at some stage before retirement (Aviva Risk Calculator). You should confirm if your employer will pay some or all off your salary if you are unable to work. \n\nThese Living Benefits are now very popular, as with medical advances many people recover from serious illness. In fact, life companies now can pay out more claims for living benefits than death benefit.\n\nAgain, there are issues to consider that are personal to each family:\n\n•\tHow much income should I protect?\n\n•\tHow long to I want this benefit to be paid for?\n\n•\tWhen do I want this benefit to start? Many employers may pay salary for a limited time.\n\n•\tWhat benefits are available from the State?\n\n•\tAre there any illness that I want to ensure are included?\n\n•\tHow much can I afford?\n\n•\tAny additional benefits and services available?\n\nThis cover complements specified illness and should not be viewed as an alternative. For example, the two largest areas for claims under income protection – Mental Health and Musculoskeletal are not typically covered under specified illness policies.\n\n**Mind My Money provide a complimentary protection review to enable you identify where your family maybe financially vulnerable.** \nThis can help improve your **financial resilience** and cover you against the uncertainties of life. \nAccording to Aviva’s risk calculator, for a couple in their 30s there is a 91% likelihood of either;\n\n i) not being able to work for a month or longer, \n\nii) incurring a serious illness or \n\niii) dying before they retire!\n\n**Request your review today, and make sure your family is properly protected.**\n\n**Your financial adviser can help you establish the most appropriate plan for your family.**\n\n*Plan payments must be kept up to date to ensure cover is maintained.*",
  "title": "Income Protection"
}