{
  "body": "Some things in life can make you feel uncomfortable. However investing your hard-earned money shouldn’t be one of them. That’s why we want to help you get comfortable investing, starting with 3 easy steps.\n\n1. Get your investor profile.\n2. Match to the fund that suits.\n3. See the expected range of returns\n\nEquity markets are volatile, they go down as well as up. They should be viewed as a medium to long term investment. The longer you keep your money invested, the greater the chances of a positive outcome. \n\nStaying fully invested through a market cycle has, in the past, ensured investors enjoy gains over the long-term as rebounds can recover any falls.\n\nAlways keep the following points in mind when investing:\n\n•\t**Stay disciplined** – stick to your plan. If unsure speak to your adviser.\n\n•\t**Volatility is normal.** Markets will fall and rise and sometimes will have severe shocks. Expect these and remember that historically each market downturn has been followed by an eventual upswing.\n\n•\tKeeping money in **cash is not the long term answer**. Bank deposit returns are at record lows! (Bonkers.ie comparison, March 2021)\n\n•\tOver the **longer term** holding money in risker assets such as equities is rewarded\n\na) In any ten year period multi asset funds have never made a loss\n\nb) In any twenty year period equities have never made a loss\n\n•\t**Diversify, diversify, diversify**. Spread your eggs across many baskets. This is how a well-managed multi asset fund can be less volatile than equities\n\n•\t**Research** properly any ESG funds you may be interested in investing in.\n\n**Responsible Investing (ESG)**\n\nDid you know that just 100 companies are reported to be responsible for 71% of global greenhouse gas emissions (Guardian, 2017).\n\n**Improve the world with your savings.** Responsible investment (RI) funds select companies which demonstrate the best environmental, social and governance (ESG) practices. We believe that these may offer investors the best of both worlds: seeking attractive financial returns and a possibility to allocate money to causes they care about.\n\n**Sustainable Finance Statements**\t\n\n*While Mind My Money considers the approach taken by Irish Life Assurance plc in terms of them integrating sustainability risks into their product offering as we have selected one preferred provider for investment products, analysis when choosing a suitable product for you will be limited to products provided by Irish Life Assurance plc. However, should you specifically seek a financial product which has sustainable investment as its sole/specific objective and no such product is available from the range of products offered by Irish Life Assurance Plc, Mind My Money will conduct analysis of the product offerings available from the other insurance undertakings, lenders and product providers with whom Mind My Money holds written appointments.*\n\n*When providing advice, Mind My Money does not consider the adverse impacts of investment decisions on sustainability. The firm will review this annually and makes revisions if and when appropriate.*\n\nWarning: The value of your investment may go down as well as up",
  "title": "Investments",
  "lLink1": "How much risk is right for you?",
  "link1": "risk-for-you.html",
  "lLink2": "",
  "link2": "",
  "lLink3": "",
  "link3": ""
}