{
  "title": "Mortgage Protection",
  "body": "Mortgage Protection is a requirement from the bank for mortgage. It helps pay off the outstanding balance on a mortgage if you die. **It’s primary role is to protect the bank,** however it does have a benefit to the family as it reduces the mortgage payment from any future outgoings. \n\nWhile this should be taken into account when considering the level of life cover a family require it should not be relied on completely.\n\nMany banks quote for mortgage protection but a borrower is not obliged to accept their quote. They should research to find the best protection for them and review regularly.\n\nIf affordable a conversion option can be very useful if your loan or health circumstances change during the term. This gives you the option of extending the term of the life cover further without the need for any medicals or any change in your health to be taken into consideration. It will take into account that you are older than when the original policy was taken out.\n\nSpeak to a financial advisor before you take out any cover to help ensure it is the most appropriate product for you.\n\n**Mind My Money provide a complimentary protection review to enable you identify where your family maybe financially vulnerable.** \nThis can help improve your financial resilience and cover you against the uncertainties of life. And they do happen! According to Aviva’s risk calculator, for a couple in their 30s there is a 91% likelihood of either;\n\n i) not being able to work for a month or longer, \n\nii) incurring a serious illness or \n\niii) dying before they retire!\n\n**Request your review today, and make sure your family is properly protected.**\n\nYour financial adviser can help you establish the most appropriate plan for your family.\n\n*Plan payments must be kept up to date to ensure cover is maintained.*",
  "link1": "https://mindmymoney-ie.blogspot.com/2021/03/what-do-i-need-to-protect-my-family.html",
  "lLink1": "Protect the different risks to your income"
}