{
  "title": "Protection",
  "body": "## Family is not an important thing, it is everything!\n\nIf there is one thing that 2020 and 2021 has reminded us, it is how precious our families are. \n\nOur goal is to protect, nurture and develop their talents while building lifelong memories.\n\nTo achieve this we use our income, it allows us to accomplish everything. It is our most important asset. \n\nBut what happens if the unthinkable happens and your income stops? How does your family survive and reach its potential without your money as support? \n\nWe buy items with our income and insure them. It makes as much, if not more sense, to insure the golden goose that lays the eggs as it does the eggs themselves.\n\n**At Mind My Money we put Family First by helping to protect your future income.**\n\nThere are various product types available. <span style=\"color:#0080FF\">**They do a different, but complimentary job.**</span> You need to make sure that you select the best mix of products to protect your income from short-, medium- and long-term loss.\nThe main categories are;\n\n1. Life assurance, \n2. Income protection\n3. Specified Illness Cover, \n4. Mortgage protection.\n\nOur Family First section will give you more information on these different types of protection.\n\n**Mind My Money provide a complimentary protection review to enable you identify where your family maybe financially vulnerable.** \n\nThis can help improve your **financial resilience** and cover you against the uncertainties of life. They do happen!\n\nAccording to Aviva’s risk calculator, for a couple in their 30s there is a 91% likelihood of either; \n\ni) not being able to work for a month or longer, \n\nii) incurring a serious illness or \n\niii) dying before they retire!\n\n**Request your review today, and make sure your family is properly protected.**\n\n**Your financial adviser can help you establish the most appropriate plan for your family.**\n\n*Plan payments must be kept up to date to ensure cover is maintained.*",
  "link1": "https://mindmymoney-ie.blogspot.com/2021/03/what-do-i-need-to-protect-my-family.html",
  "lLink1": "Protect the different risks to your income"
}