{
  "body": "**No matter what type of pension arrangement you have it is important to get advice when you retire to ensure you decide on the options that best suit you.** This advice will always be subject to the pension rules and tax rates pertaining at the time. \n\nIf you are retiring on a Defined Benefit (DB) pension you will have a defined income for the rest of your life related to your earnings at or near retirement and the number of years service. You should also consider any spouse and children options that may be available. There are funding risks within a DB scheme and the number of DB schemes in Ireland have fallen from above 2,500 in the early 1990s to 582 in 2019 (Pension Authority, DB Statistical Review, 2019).\n\nWhen retiring with a Defined Contribution (DC) pension you are entitled to take a lump sum which could be tax free up to €200,000. The amount of this lump sum is determined by either;\n\n1. Up to 1.5 times final salary (from a DC company pension and must then take an annuity)\n2. 25% of fund value (option of annuity or Approved Retirement (ARF))\n\nThe balance of the fund can then be put into an;\n\n1. Annuity – guaranteed income for the rest of your life.\n2. ARF – your personal retirement fund where you can draw down income (minimum 4% up to age 71) as required. While you retain flexibility and control over your income there is a risk it will bomb out and not last for your retirement years. However, if you die, any remaining funds will be included in your estate.\n\n**Due to people living longer (Central Statistics Office, population forecast 2017 2051) and low fixed interest rate returns, annuities have become expensive. This along with the flexibility and control of ARFs’ have made ARFs’ extremely popular.**\n\n<a href=\"https://youtu.be/F7QjyrqcUhU\" target=\"_blank\">How to protect your ARF from tax in your estate planning.(youtube)</a>  \n\nYour financial adviser will go through the specific requirements of each option. **Look for projections into retirement to ensure you have enough to reach at least normal life expectancy.**\n\n***Not retiring yet?*** Talk to your financial advisor on what your retirement potentially looks like. They can then help you amend your plan if there are any shortfalls identified.\n\n***Irish Revenue pension rules and tax rates pertaining to 2021 are used in the discussions on this page.***",
  "title": "Retirement Options",
  "link1": "https://mindmymoney-ie.blogspot.com/2021/03/no-one-likes-giving-money-to-revenue.html",
  "lLink1": "Put your tax into your pension"
}